In [6]:
import pandas as pd

In [7]:
url = "https://web.stanford.edu/class/archive/cs/cs109/cs109.1166/stuff/titanic.csv"

df = pd.read_csv('train.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [8]:
df['Age'].mean()

np.float64(29.69911764705882)

In [9]:
df['Age'].sum()

np.float64(21205.17)

In [10]:
df['Age'].max()

np.float64(80.0)

In [11]:
df['Age'].min()

np.float64(0.42)

In [12]:
df['Age'].std()

np.float64(14.526497332334042)

In [13]:
df['Age'].value_counts(normalize=True)

Age
24.00    0.042017
22.00    0.037815
18.00    0.036415
28.00    0.035014
30.00    0.035014
           ...
24.50    0.001401
0.67     0.001401
0.42     0.001401
34.50    0.001401
74.00    0.001401
Name: proportion, Length: 88, dtype: float64

In [14]:
df[df['Survived'] == 1].count()

PassengerId    342
Survived       342
Pclass         342
Name           342
Sex            342
Age            290
SibSp          342
Parch          342
Ticket         342
Fare           342
Cabin          136
Embarked       340
dtype: int64

In [15]:
df[df['Survived'] == 0].count()

PassengerId    549
Survived       549
Pclass         549
Name           549
Sex            549
Age            424
SibSp          549
Parch          549
Ticket         549
Fare           549
Cabin           68
Embarked       549
dtype: int64

In [16]:
df['Survived'].value_counts(normalize=True)

Survived
0    0.616162
1    0.383838
Name: proportion, dtype: float64

In [17]:
female_mask = df['Sex']=='female'

df[female_mask]['Age']

1      38.0
2      26.0
3      35.0
8      27.0
9      14.0
       ...
880    25.0
882    22.0
885    39.0
887    19.0
888     NaN
Name: Age, Length: 314, dtype: float64

In [18]:
df.groupby(by='Sex')['Survived'].value_counts(normalize=True)

Sex     Survived
female  1           0.742038
        0           0.257962
male    0           0.811092
        1           0.188908
Name: proportion, dtype: float64

Puliga tahlil

In [19]:
df.groupby(by=['Pclass', 'Sex'])[['Survived', 'Fare']].mean()

               Survived        Fare
Pclass Sex
1      female  0.968085  106.125798
       male    0.368852   67.226127
2      female  0.921053   21.970121
       male    0.157407   19.741782
3      female  0.500000   16.118810
       male    0.135447   12.661633

In [20]:
df[df['Survived'] == 1].groupby(by=['Pclass','Sex'])[['Age', 'Fare']].mean()

                     Age        Fare
Pclass Sex
1      female  34.939024  105.978159
       male    36.248000   74.637320
2      female  28.080882   22.288989
       male    16.022000   21.095100
3      female  19.329787   12.464526
       male    22.274211   15.579696

In [21]:
df[df['Survived'] != 1].groupby(by=['Pclass','Sex'])[['Age', 'Fare']].mean()

                     Age        Fare
Pclass Sex
1      female  25.666667  110.604167
       male    44.581967   62.894910
2      female  36.000000   18.250000
       male    33.369048   19.488965
3      female  23.818182   19.773093
       male    27.255814   12.204469

In [26]:
df.groupby(['Pclass'])['Fare'].mean().to_list()

[84.1546875, 20.662183152173913, 13.675550101832993]

In [32]:
df.pivot_table(values='Survived', index='Pclass', aggfunc='mean').to_dict()['Survived']

{1: 0.6296296296296297, 2: 0.47282608695652173, 3: 0.24236252545824846}